import React, {Component, Fragment} from 'react';

import ContentWrapper from "../../components/ContentWrapper";

import './Introduction.scss'
import './img/intro_bg.png';

export default class Introduction extends Component {
  render() {
    return (
      <section className="introduction">
        <div className="introduction__bg"></div>
        <h1 className="visually-hidden">TopCar - автомойка, автосервис, шиномонтаж</h1>
        <ContentWrapper classes="introduction__wrapper">
          <IntroductionInfo />
        </ContentWrapper>
        <IntroductionAdditionalInfo/>
      </section>
    );
  }
}

function IntroductionAdditionalInfo() {
  return (
    <div className="introduction__additional-info">
      <ul className="introduction__additional-list">
        <li className="introduction__additional-item">
          <svg className="introduction__additional-icon" width="30" height="30" viewBox="0 0 512 512">
            <path
              d="M256 0C156.748 0 76 80.748 76 180c0 33.534 9.289 66.26 26.869 94.652l142.885 230.257A15 15 0 0 0 258.499 512h.119a14.997 14.997 0 0 0 12.75-7.292L410.611 272.22C427.221 244.428 436 212.539 436 180 436 80.748 355.252 0 256 0zm128.866 256.818L258.272 468.186l-129.905-209.34C113.734 235.214 105.8 207.95 105.8 180c0-82.71 67.49-150.2 150.2-150.2S406.1 97.29 406.1 180c0 27.121-7.411 53.688-21.234 76.818z"
              fill="#FFF"/>
            <path
              d="M256 90c-49.626 0-90 40.374-90 90 0 49.309 39.717 90 90 90 50.903 0 90-41.233 90-90 0-49.626-40.374-90-90-90zm0 150.2c-33.257 0-60.2-27.033-60.2-60.2 0-33.084 27.116-60.2 60.2-60.2s60.1 27.116 60.1 60.2c0 32.683-26.316 60.2-60.1 60.2z"
              fill="#FFF"/>
          </svg>


          <p className="introduction__additional-text">
            1-я Бородинская ул., 2A, Москва, 121059
          </p>
        </li>
        <li className="introduction__additional-item">
          <svg className="introduction__additional-icon" width="30" height="30" viewBox="0 0 512 512">
            <path
              d="M490.114 12.813H132.568c-12.012.014-21.746 9.748-21.76 21.76v98.62l-16.35-24.525c-7.484-11.289-22.535-14.676-34.133-7.68l-33.638 20.224a49.355 49.355 0 0 0-22.545 29.244C-8.129 195.137.976 272.116 113.966 385.123c89.855 89.762 156.85 113.937 203.024 113.937 10.69.049 21.339-1.34 31.659-4.13a49.44 49.44 0 0 0 29.252-22.519l20.198-33.673c6.968-11.589 3.584-26.609-7.68-34.091l-80.546-53.692c-11.049-7.308-25.859-4.905-34.031 5.521l-23.45 30.148a8.166 8.166 0 0 1-10.445 2.21l-4.463-2.458c-14.686-8.004-32.964-17.971-69.879-54.886a605.694 605.694 0 0 1-11.008-11.307h333.517c11.982.009 21.713-9.676 21.76-21.658V34.573c-.014-12.012-9.748-21.746-21.76-21.76zM229.318 401.362l4.335 2.381c10.897 6.093 24.614 3.266 32.213-6.639l23.45-30.148a8.294 8.294 0 0 1 11.093-1.801l80.546 53.692a8.243 8.243 0 0 1 2.5 11.093l-20.198 33.673a32.425 32.425 0 0 1-19.123 14.848c-40.337 11.093-110.933 1.707-218.078-105.446S9.56 195.273 20.627 154.97a32.427 32.427 0 0 1 14.839-19.123l33.673-20.207a8.251 8.251 0 0 1 11.093 2.5l53.717 80.546a8.285 8.285 0 0 1-1.801 11.093l-30.157 23.458c-9.903 7.597-12.731 21.311-6.639 32.205l2.389 4.335c8.533 15.65 19.14 35.123 57.805 73.779 38.666 38.657 58.131 49.272 73.772 57.806zm265.49-102.836a4.659 4.659 0 0 1-4.693 4.608H141.203a215.204 215.204 0 0 1-28.476-41.506l-2.458-4.48a8.14 8.14 0 0 1 2.202-10.428l30.157-23.458c10.43-8.17 12.833-22.982 5.521-34.031l-20.275-30.43V34.573a4.642 4.642 0 0 1 4.693-4.693h357.547a4.642 4.642 0 0 1 4.693 4.693v263.953z"/>
            <path
              d="M460.725 52.323l-142.618 108.16a11.512 11.512 0 0 1-13.534 0L162.008 52.323a8.535 8.535 0 0 0-11.959 1.643 8.535 8.535 0 0 0 1.643 11.959l142.583 108.151a28.721 28.721 0 0 0 34.133 0L471.034 65.925a8.53 8.53 0 0 0 1.638-11.963 8.532 8.532 0 0 0-11.947-1.639zM238.517 174.793l-87.415 93.611a8.535 8.535 0 0 0 12.484 11.64l87.416-93.653a8.535 8.535 0 0 0-12.485-11.598zM384.728 174.793a8.534 8.534 0 0 0-12.062-.422 8.534 8.534 0 0 0-.422 12.062l87.39 93.611a8.534 8.534 0 0 0 12.062.422 8.534 8.534 0 0 0 .422-12.062l-87.39-93.611z"/>
          </svg>
          <p className="introduction__additional-text">
            +7 (985) 355-10-10 <br/>
            topcarcleaning@yandex.ru
          </p>
        </li>
        <li className="introduction__additional-item">
          <svg className="introduction__additional-icon" width="30" height="30" viewBox="0 0 60 60">
            <path
              d="M30 0C13.458 0 0 13.458 0 30s13.458 30 30 30 30-13.458 30-30S46.542 0 30 0zm0 58C14.561 58 2 45.439 2 30S14.561 2 30 2s28 12.561 28 28-12.561 28-28 28z"/>
            <path
              d="M31 26.021V15.879a1 1 0 1 0-2 0v10.142a3.995 3.995 0 0 0-2.858 2.858H19a1 1 0 1 0 0 2h7.142c.447 1.72 2 3 3.858 3 2.206 0 4-1.794 4-4 0-1.859-1.28-3.411-3-3.858zm-1 5.858c-1.103 0-2-.897-2-2s.897-2 2-2 2 .897 2 2-.897 2-2 2zM30 9.879a1 1 0 0 0 1-1v-1a1 1 0 1 0-2 0v1a1 1 0 0 0 1 1zM30 49.879a1 1 0 0 0-1 1v1a1 1 0 1 0 2 0v-1a1 1 0 0 0-1-1zM52 28.879h-1a1 1 0 1 0 0 2h1a1 1 0 1 0 0-2zM9 28.879H8a1 1 0 1 0 0 2h1a1 1 0 1 0 0-2zM44.849 13.615l-.707.707a.999.999 0 1 0 1.414 1.414l.707-.707a.999.999 0 1 0-1.414-1.414zM14.444 44.021l-.707.707a.999.999 0 1 0 1.414 1.414l.707-.707a.999.999 0 1 0-1.414-1.414zM45.556 44.021a.999.999 0 1 0-1.414 1.414l.707.707a.997.997 0 0 0 1.414 0 .999.999 0 0 0 0-1.414l-.707-.707zM15.151 13.615a.999.999 0 1 0-1.414 1.414l.707.707a.997.997 0 0 0 1.414 0 .999.999 0 0 0 0-1.414l-.707-.707z"/>
          </svg>
          <p className="introduction__additional-text">
            Eжедневно и круглосуточно
          </p>
        </li>
      </ul>
    </div>
  );
}

function IntroductionInfo() {
  return (
    <Fragment>
       <span className="introduction__logo-text">
          Top
        </span>
      <ul className="introduction__offers">
        <li className="introduction__item">Мойка</li>
        <li className="introduction__rhombus" aria-hidden="true"></li>
        <li className="introduction__item">Шиномонтаж</li>
        <li className="introduction__rhombus" aria-hidden="true"></li>
        <li className="introduction__item">Автосервис</li>
      </ul>
      <span className="introduction__logo-text introduction__logo-text--yellow">
         Car
        </span>
    </Fragment>
  );
}
